In [32]:
import numpy as np
import pandas as pd

In [33]:
#Create random matrix
data = np.random.randn(4,3)
dataFrame = pd.DataFrame(data)
dataFrame

          0         1         2
0  1.640390  0.095673  2.042598
1 -0.278509  0.801985  2.567252
2 -0.411610 -0.320499  0.281941
3  0.088513  0.716298  1.609782

In [34]:
#Create matrix
newDataFrame = pd.DataFrame(data,index=["Soner","Hatice","Hacer","Nuri"],columns=["Maas","Yas","Puan"])
newDataFrame

            Maas       Yas      Puan
Soner   1.640390  0.095673  2.042598
Hatice -0.278509  0.801985  2.567252
Hacer  -0.411610 -0.320499  0.281941
Nuri    0.088513  0.716298  1.609782

In [35]:
#Bring column
newDataFrame["Maas"]

Soner     1.640390
Hatice   -0.278509
Hacer    -0.411610
Nuri      0.088513
Name: Maas, dtype: float64

In [36]:
#Find index
newDataFrame.loc["Soner"]

Maas    1.640390
Yas     0.095673
Puan    2.042598
Name: Soner, dtype: float64

In [37]:
#Find index with index num
newDataFrame.iloc[1]

Maas   -0.278509
Yas     0.801985
Puan    2.567252
Name: Hatice, dtype: float64

In [38]:
#Add the column
newDataFrame["EmeklilikYasi"] = [40,40,40,40]
newDataFrame

            Maas       Yas      Puan  EmeklilikYasi
Soner   1.640390  0.095673  2.042598             40
Hatice -0.278509  0.801985  2.567252             40
Hacer  -0.411610 -0.320499  0.281941             40
Nuri    0.088513  0.716298  1.609782             40

In [39]:
#Delete the column
newDataFrame.drop("EmeklilikYasi", axis = 1, inplace=True)
newDataFrame

            Maas       Yas      Puan
Soner   1.640390  0.095673  2.042598
Hatice -0.278509  0.801985  2.567252
Hacer  -0.411610 -0.320499  0.281941
Nuri    0.088513  0.716298  1.609782

In [40]:
#Delete the index
newDataFrame.drop("Hacer", axis = 0, inplace=True)
newDataFrame

            Maas       Yas      Puan
Soner   1.640390  0.095673  2.042598
Hatice -0.278509  0.801985  2.567252
Nuri    0.088513  0.716298  1.609782

In [42]:
#Filter the column
newDataFrame[newDataFrame["Yas"] > 0]

            Maas       Yas      Puan
Soner   1.640390  0.095673  2.042598
Hatice -0.278509  0.801985  2.567252
Nuri    0.088513  0.716298  1.609782

In [45]:
#Bring the indexis
newDataFrame.reset_index()

    index      Maas       Yas      Puan
0   Soner  1.640390  0.095673  2.042598
1  Hatice -0.278509  0.801985  2.567252
2    Nuri  0.088513  0.716298  1.609782

In [50]:
#Add new column
newIndexList = ["Son","Hat","Nur"]
newDataFrame["Kısa"] = newIndexList
newDataFrame

            Maas       Yas      Puan Kısa
Soner   1.640390  0.095673  2.042598  Son
Hatice -0.278509  0.801985  2.567252  Hat
Nuri    0.088513  0.716298  1.609782  Nur

In [52]:
#Set column to index
newDataFrame.set_index("Kısa",inplace=True)
newDataFrame

          Maas       Yas      Puan
Kısa
Son   1.640390  0.095673  2.042598
Hat  -0.278509  0.801985  2.567252
Nur   0.088513  0.716298  1.609782

In [55]:
#Multi index: list zip and then Multi index
ilkIndex = ["Simpson","Simpson","Simpson","South Park","South Park","South Park"]
icIndex = ["Homer","Bart","Marge","Cartman","Kenny","Kylie"]
birlesmisIndex = list(zip(ilkIndex,icIndex))
birlesmisIndex = pd.MultiIndex.from_tuples(birlesmisIndex)
birlesmisIndex

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',   'Kylie')],
           )

In [59]:
#Creating with multi index
myCartoonList = [[30,"A"],[35,"B"],[10,"C"],[10,"D"],[11,"E"],[9,"F"]]
cartoonNumpyList = np.array(myCartoonList)
cartoonDataFrame = pd.DataFrame(cartoonNumpyList, index=birlesmisIndex, columns=["Yaş","City"])
cartoonDataFrame

                   Yaş City
Simpson    Homer    30    A
           Bart     35    B
           Marge    10    C
South Park Cartman  10    D
           Kenny    11    E
           Kylie     9    F

In [60]:
cartoonDataFrame.loc["Simpson"]

      Yaş City
Homer  30    A
Bart   35    B
Marge  10    C

In [65]:
#Bring the category
cartoonDataFrame.loc["Simpson"]

      Yaş City
Homer  30    A
Bart   35    B
Marge  10    C

In [64]:
#Bring the inside index
cartoonDataFrame.loc["Simpson","Homer"]

Yaş     30
City     A
Name: (Simpson, Homer), dtype: object

In [66]:
#Add index name
cartoonDataFrame.index.names = ["Film Names","Names"]
cartoonDataFrame

                   Yaş City
Film Names Names
Simpson    Homer    30    A
           Bart     35    B
           Marge    10    C
South Park Cartman  10    D
           Kenny    11    E
           Kylie     9    F